In [3]:
import openpyxl as oxl
from openpyxl import Workbook, load_workbook

In [5]:
wb2 = load_workbook('주소록.xlsx')
print(wb2.sheetnames)

['두번째시트', 'Sheet1', '네번째시트']

In [6]:
ws = wb2['두번째시트']

In [8]:
ws.iter_rows()

In [13]:
for col in ws.iter_cols():
    for call in col:
        print(call, call.value)

<Cell '두번째시트'.A1> 이름
<Cell '두번째시트'.A2> 홍길동
<Cell '두번째시트'.A3> 김길동
<Cell '두번째시트'.A4> 박윤수
<Cell '두번째시트'.B1> 전화번호
<Cell '두번째시트'.B2> 02-302-3333
<Cell '두번째시트'.B3> 010-222-3334
<Cell '두번째시트'.B4> 010-0000-0000
<Cell '두번째시트'.C1> 주소
<Cell '두번째시트'.C2> 한양
<Cell '두번째시트'.C3> 서울
<Cell '두번째시트'.C4> 광주

### Pandas 이용한 내용 읽기

In [16]:
import pandas as pd

### numpy

In [20]:
dat = pd.read_excel("주소록.xlsx")
dat

    이름           전화번호  주소
0  홍길동    02-302-3333  한양
1  김길동   010-222-3334  서울
2  박윤수  010-0000-0000  광주

In [19]:
dat = pd.read_excel("주소록.xlsx", sheet_name='두번째시트')
dat

    이름           전화번호  주소
0  홍길동    02-302-3333  한양
1  김길동   010-222-3334  서울
2  박윤수  010-0000-0000  광주

In [26]:
a = list(dat.iterrows())
print(len(a))
print(a[0])
print(a[0][1])

3
(0, 이름              홍길동
전화번호    02-302-3333
주소               한양
Name: 0, dtype: object)
이름              홍길동
전화번호    02-302-3333
주소               한양
Name: 0, dtype: object

In [27]:
for idx, row in dat.iterrows():
    print(idx, row[0], row[1])

0 홍길동 02-302-3333
1 김길동 010-222-3334
2 박윤수 010-0000-0000

In [28]:
dat_ori = dat.copy()

In [31]:
dat

    이름           전화번호  주소
0  홍길동    02-302-3333  한양
1  김길동   010-222-3334  서울
2  박윤수  010-0000-0000  광주

In [32]:
dat.loc[dat['전화번호'].isnull(), '전화번호 체크'] = 'NOK'
dat.loc[dat['전화번호'].notnull(), '전화번호 체크'] = 'OK'
dat

    이름           전화번호  주소 전화번호 체크
0  홍길동    02-302-3333  한양      OK
1  김길동   010-222-3334  서울      OK
2  박윤수  010-0000-0000  광주      OK

In [39]:
iff=(dat['전화번호'].str.len()==12) | (dat['전화번호'].str.len()==13)
dat.loc[iff, '전화번호 체크'] = 'OK'
dat.loc[~iff, '전화번호 체크'] = 'NOK'
dat

    이름           전화번호  주소 전화번호 체크
0  홍길동    02-302-3333  한양     NOK
1  김길동   010-222-3334  서울      OK
2  박윤수  010-0000-0000  광주      OK

In [42]:
ch_tel = dat['전화번호'].str.contains('\d{2,3}-\d{3}-\d{4}')

In [43]:
dat.loc[ch_tel, '전화번호 체크'] = 'OK'
dat.loc[~ch_tel, '전화번호 체크'] = 'NOK'
dat

    이름           전화번호  주소 전화번호 체크
0  홍길동    02-302-3333  한양      OK
1  김길동   010-222-3334  서울      OK
2  박윤수  010-0000-0000  광주     NOK

In [46]:
writer = pd.ExcelWriter('주소록_chk.xlsx', engine='openpyxl')
dat_ori.to_excel(writer, sheet_name='sheet_ori', index=False)
dat.to_excel(writer, sheet_name='sheet_chk', index=False)
writer.save()